/* label of button to dismiss sheet without agreeing (Close rather than OK) */
"Close" = "Sulje";

/* primary label with product name */
"Connecting to %@..." = "Muodostetaan yhteys kohteeseen %@...";

/* primary label */
"Connecting..." = "Yhdistetään...";

/*
 * Primary label displayed when app runs in "about box" mode.
 * Most of the time this is obscured by the sheet displaying the information
 * about the application.
 */
"PrimaryLabelAbout" = "Tietoja...";

//----- download progress info -----------------------------------------------//

/* No comment provided by engineer. */
"Downloading (%@ out of %@ Bytes)" = "Ladataan (%1$@/%2$@ tavua)";

/* No comment provided by engineer. */
"Downloading (%@ out of %@ KB)" = "Ladataan (%1$@&%2$@ kt)";

/* No comment provided by engineer. */
"Downloading (%@ out of %@ MB)" = "Ladataan (%1$@/%2$@ Mt)";

//----- product display names ------------------------------------------------//

/** Name displayed in lieu of product when product is not known */
"UnknownTheProduct" = "sovellus";

/* G2M product display name */
"GoToMeeting" = "GoToMeeting";

/* G2T product display name */
"GoToTraining" = "GoToTraining";

/* G2W product display name */
"GoToWebinar" = "GoToWebinar";

/* G2A product display name */
"GoToAssist" = "GoToAssist";

/* G2AC product display name */
"GoToAssist Corporate" = "GoToAssist Corporate";

/* GoToMyPC product display name */
"GoToMyPC" = "GoToMyPC";


//----- About Box ------------------------------------------------------------//


/* Message (title) displayed on face of about box sheet. */
"AboutBoxMessage" = "Tietoja GoTo Openerista";

/* Detailed info displayed on face of about box sheet. */
"AboutBoxInfo" = "GoTo Openerin avulla GoTo-sivustot ja -ohjelmistot toimivat sujuvasti tietokoneessasi.\n\nVersio: %@\n\nSijainti: %@";


//----- task labels for main window ------------------------------------------//

/* generic launch progress label */
"Initializing" = "Alustetaan";

/*
 * Progress label displayed while just-launched, persistently-installed app
 * initially downloads session parameters from Launcher Service
 */
"DownloadingArgs" = "Pyydetään tarkkoja käynnistystietoja";

/* progress label displayed while waiting for another DownloaderApp to finish */
"WaitingForMutex" = "Odotetaan toisen GoTo Openerin päättymistä";

/* progress label displayed while DownloaderApp installs itself to persistent location */
"InstallingDlApp" = "Asennetaan GoTo Opener";

/* generic starting plugin download progress label */
"Starting Plugin Download" = "Käynnistetään laajennuksen lataus";

/* generic installing plugin label */
"Installing Plugin" = "Asennetaan laajennus";

/* generic starting download progress label */
"Starting Download" = "Käynnistetään lataus";

/* generic downloading progress label */
"Downloading" = "Ladataan";

/* generic verify archive progress label */
"Verifying" = "Vahvistetaan";

/* generic unarchiving progress label */
"Unzipping" = "Puretaan";

/* generic launch progress label */
"Installing" = "Asennetaan";

/* generic launch progress label */
"Launching" = "Käynnistetään";

/* launch installer progress label */
"Launching Installer" = "Käynnistetään asennusohjelma";

//----- Message text for error alert sheets ----------------------------------//

/* download failed alert message */
"Download Failed" = "Lataus epäonnistui";

/* unarchive failed alert message */
"Unarchive Failed" = "Purku epäonnistui";

/* installation failed alert message */
"Installation Failed" = "Asennus epäonnistui";

/* launch failed alert message */
"Launch Failed" = "Käynnistys epäonnistui";

//----- Info text for error alert sheets -------------------------------------//

/* boilerplate introduction for error sheets indicating complete failure of the Launcher to launch app, into which specific product name is inserted */
"AppFatalMsgPre"  = "Valitettavasti GoTo Opener ei voinut käynnistää sovellusta %@.";

/* boilerplate introduction for error sheets indicating complete failure of the Launcher to install package, into which specific product name is inserted */
"InstallFatalMsgPre"  = "Valitettavasti GoTo Opener ei voinut asentaa pakettia %@.";

/* boilerplate conclusion for error sheets indicating complete failure of the Launcher */
"GenericFatalMsgPost" = "Käynnistä lataus uudelleen tai ota yhteys globaaliin asiakastukeen osoitteessa \nhttp://link.logmeininc.com/get-help.";

/* boilerplate introduction for error sheets indicating failure of the Launcher to download component due to SSL certificate validation errors. */
"SslCertFatalMsgPre"  = "Valitettavasti GoTo Opener ei voi luottaa latauspalvelimeen.";

/* boilerplate conclusion for error sheets indicating failure of the Launcher to download component due to SSL certificate validation errors. */
"SslCertFatalMsgPost" = "Varmista, että olet päivittänyt luotetut varmenteet avainketjuihisi, tai ota yhteys globaaliin asiakastukeen osoitteessa \nhttp://link.logmeininc.com/get-help.";

/* notify user that product endpoint version doesn't support OS version */
"ProductSupportForOsErrorInfo" = "Pyydetty %@ -versio ei tue tätä Mac OS X -versiota.";

/* app download failed alert informative text */
"DownloadAppFailedErrorInfo" = "Tarvittavan sovelluksen lataaminen palvelimiltamme epäonnistui.";

/* app download failed alert instructions to manually download and install endpoint */
"DownloadAppFailedOfferManualDownload" = "%@ ei käynnistynyt, koska sovelluksen lataaminen epäonnistui. Tallenna tiedosto verkkoselaimen avulla:\n\n1. Valitse ‘Lataa selaimesta’.\n2. Avaa ja asenna ladattu tiedosto.\n3. Yritä liittyä istuntoon uudelleen.";

/* app download failed alert instructions to manually download and install endpoint, post part */
"DownloadAppFailedOfferManualDownloadPost" = "Ota tarvittaessa yhteys järjestelmänvalvojaan tai %@-tukeen tässä osoitteessa: https://link.logmeininc.com/get-help";


/* app download failed alert download button */
"Download" = "Lataa selaimesta";

/* installer download failed alert informative text */
"DownloadInstallerFailedErrorInfo" = "Asennusohjelman lataaminen palvelimiltamme epäonnistui.";

/* app unarchive failed alert informative text */
"UnarchiveAppFailedErrorInfo" = "Tarvittavan sovelluksen purkaminen epäonnistui.";

/* installer unarchive failed alert informative text */
"UnarchiveInstallerFailedErrorInfo" = "Asennusohjelman purkaminen epäonnistui.";

/* failed to place app bundle in permanent location, alert informative text */
"InstallAppFailedErrorInfo" = "Tarvittavan sovelluksen asentaminen epäonnistui.";

/* app launch failed alert informative text */
"LaunchAppFailedErrorInfo" = "Tarvittavan sovelluksen käynnistäminen epäonnistui.";

/* installer launch failed alert informative text */
"LaunchInstallerFailedErrorInfo" = "Asennusohjelman käynnistäminen epäonnistui.";

/* app arguments download failed alert informative text */
"DownloadAppArgumentsFailedErrorInfo" = "Tarvittavien sovellusargumenttien lataaminen palvelimiltamme epäonnistui.";


//----- for SSL error alert sheets -------------------------------------------//

/* label of button to retry on authentication timeout (not abort the app) */
"AuthTimeoutErrorRetryButtonLabel" = "Yritä uudelleen";

/* label of button to cancel retry on authentication timeout (so abort the app) */
"AuthTimeoutErrorCancelButtonLabel" = "Sulje";

/* authentication timeout alert message */
"AuthTimeoutErrorMsg" = "Todentaminen kesti liian kauan";

/* authentication timeout alert informative text */
"AuthTimeoutErrorInfo" = "Kirjautumistietojen todennus ei onnistunut tarpeeksi nopeasti. Antamasi tunnus tai salasana saattaa olla väärä. Yritä uudelleen.";

/* label of button to retry on connection lost during authentication (not abort the app) */
"AuthDisconnectErrorRetryButtonLabel" = "Yritä uudelleen";

/* label of button to cancel retry on connection lost during authentication (so abort the app) */
"AuthDisconnectErrorCancelButtonLabel" = "Sulje";

/* disconnect during authentication alert message */
"AuthDisconnectErrorMsg" = "Todentaminen epäonnistui";

/* disconnect during authentication alert informative text */
"AuthDisconnectErrorInfo" = "Verkkoyhteys katkesi odottamatta todentamisen aikana. Antamasi tunnus tai salasana saattaa olla väärä. Yritä uudelleen.";

/* SSL server certificate error alert message */
"ServerSslCertErrorMsg" = "Palvelimen käyttäjätietoihin ei luoteta";

/* generic SSL server certificate error informative text */
"ServerSslCertError" = "Palvelimen varmenne näyttää olevan väärä. Jos muodostat yhteyden palvelimeen, luottamukselliset tietosi saattavat vaarantua.";

/* generic SSL server certificate error informative text <URL including host> */
"ServerSslCertErrorWithUrl" = "Palvelimen varmenne kohteessa \\'%@\\' näyttää olevan väärä. Jos muodostat yhteyden palvelimeen, luottamukselliset tietosi saattavat vaarantua.";

/* generic SSL server certificate error informative text <host name> */
"ServerSslCertErrorWithHostName" = "Palvelimen \\'%@\\' varmenne näyttää olevan väärä. Jos muodostat yhteyden palvelimeen, luottamukselliset tietosi saattavat vaarantua.";

/* label of button to close server certificate error dialog and abort the app */
"ServerCertErrorCancelButtonLabel" = "Sulje";
